import React from "react";

/**
 * GNB - 인덱스차트 아이콘
 * @param {boolean} isActive IndexChart 활성화 여부
 */
const IndexChartIcon = ({ isActive }) => {
  return (
    <svg
      width="24"
      height="24"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      {isActive ? (
        <>
          <svg
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M3 13.447H6.65813C6.93428 13.447 7.15813 13.6709 7.15813 13.947V21.5H2.5V13.947C2.5 13.6709 2.72386 13.447 3 13.447Z"
              stroke="#909090"
            />
            <path
              d="M9.78976 10.052H13.4479C13.724 10.052 13.9479 10.2759 13.9479 10.552V21.4999H9.28976V10.552C9.28976 10.2759 9.51362 10.052 9.78976 10.052Z"
              stroke="#909090"
            />
            <path
              d="M20.2377 7.78906H16.5795C16.3034 7.78906 16.0795 8.01292 16.0795 8.28906V21.5002H20.7377V8.28906C20.7377 8.01292 20.5138 7.78906 20.2377 7.78906Z"
              stroke="#909090"
            />
            <path
              d="M3.51871 10.3562L18.4086 2.76235M18.4086 2.76235L16.1751 2M18.4086 2.76235L17.6938 5.04049"
              stroke="#909090"
              strokeWidth="1.2"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
          </svg>
        </>
      ) : (
        <>
          <path
            d="M2 13.947C2 13.3947 2.44772 12.947 3 12.947H6.65813C7.21042 12.947 7.65813 13.3947 7.65813 13.947V22H2V13.947Z"
            stroke="#919191"
          />
          <path
            d="M8.78976 10.552C8.78976 9.99972 9.23748 9.552 9.78976 9.552H13.4479C14.0002 9.552 14.4479 9.99972 14.4479 10.552V21.9999H8.78976V10.552Z"
            stroke="#919191"
          />
          <path
            d="M21.2377 8.28906C21.2377 7.73678 20.7899 7.28906 20.2377 7.28906H16.5795C16.0272 7.28906 15.5795 7.73678 15.5795 8.28906V22.0002H21.2377V8.28906Z"
            stroke="#919191"
          />
          <path
            d="M3.51871 10.3562L18.4086 2.76235M18.4086 2.76235L16.1751 2M18.4086 2.76235L17.6938 5.04049"
            stroke="#909090"
            strokeWidth="1.2"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
        </>
      )}
    </svg>
  );
};

export default IndexChartIcon;
